# index 다루기 -----------------------------------

- 인덱스의 일부 변경하는 경우

- 특정 갈럼을 인덱스 설정하는 경우

- 기존 인덱스에 새로 추가하는 경우

- 0-base 인덱스로 리셋하는 경우

In [57]:
# 모듈 로딩 -----------------------------------------------------
import pandas as pd

# DF 객체 생성 --------------------------------------------------
# 성적 DataFrame 객체 생성---------------------------------------
df=pd.DataFrame({'이름':['서준','우현','인아'],
           '수학':[90,80,70],
           '영어':[98,20,72],
           '음악':[93,30,20],
           '체육':[30,50,60]})

df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   이름      3 non-null      object
 1   수학      3 non-null      int64
 2   영어      3 non-null      int64
 3   음악      3 non-null      int64
 4   체육      3 non-null      int64
dtypes: int64(4), object(1)
memory usage: 248.0+ bytes

In [58]:
# DF의 속성 읽기 -> index, columns, shape
print(df)
print(df.index)

   이름  수학  영어  음악  체육
0  서준  90  98  93  30
1  우현  80  20  30  50
2  인아  70  72  20  60
RangeIndex(start=0, stop=3, step=1)

In [59]:
df

   이름  수학  영어  음악  체육
0  서준  90  98  93  30
1  우현  80  20  30  50
2  인아  70  72  20  60

In [60]:
df.columns

Index(['이름', '수학', '영어', '음악', '체육'], dtype='object')

In [61]:
df.shape

(3, 5)

In [62]:
df.info

<bound method DataFrame.info of    이름  수학  영어  음악  체육
0  서준  90  98  93  30
1  우현  80  20  30  50
2  인아  70  72  20  60>

# 특정 컬럼을 인덱스 설정 
- 조건 : 중복 / NaN (Nat a Number) : 빈 칸
- 생성 : 
    - DF객체변수명.set_index('컬럼명',inplace=False) <- 기본값
    - DF객체변수명.set_index(['컬럼명'.'컬럼명'], inplace=False) <- 기본값

In [63]:
# 이름 컬럼 => 행 인덱스 설정
df.set_index('이름',inplace=True)

In [64]:
df.index

Index(['서준', '우현', '인아'], dtype='object', name='이름')

In [65]:
df

    수학  영어  음악  체육
이름
서준  90  98  93  30
우현  80  20  30  50
인아  70  72  20  60

# 인덱스 초기화(리셋)---------------------------------
- 기존의 컬럼 인덱스 => 컬럼 돌려주기
- 메서드 : DF객체변수명.reset_index()

In [66]:
df.reset_index(inplace=True)

In [67]:
df

   이름  수학  영어  음악  체육
0  서준  90  98  93  30
1  우현  80  20  30  50
2  인아  70  72  20  60

In [68]:
# 행(row) 추가 ------------------------------------------------------
df.loc[3]=['우현',60,50,40,50]
df

   이름  수학  영어  음악  체육
0  서준  90  98  93  30
1  우현  80  20  30  50
2  인아  70  72  20  60
3  우현  60  50  40  50

In [71]:
# 특정 컬럼 인덱스로 설정
df.set_index(['이름','수학'])
df

   이름  수학  영어  음악  체육
0  서준  90  98  93  30
1  우현  80  20  30  50
2  인아  70  72  20  60
3  우현  60  50  40  50

# 인덱스 재배열 설정 ---------------------------------

- 기존 인덱스에 변경을 가하는 것

- 원본 적용 inplace = False 기본값

- 메서드 : DF객체변수명.reindex([인덱스 리스트],fill_value=값)

In [72]:
df.index

Int64Index([0, 1, 2, 3], dtype='int64')

In [75]:
df1=df.reindex([0,1,2,3,4,5], fill_value=0) #fill_value 없으면 NaN가 뜸.
df1

   이름  수학  영어  음악  체육
0  서준  90  98  93  30
1  우현  80  20  30  50
2  인아  70  72  20  60
3  우현  60  50  40  50
4   0   0   0   0   0
5   0   0   0   0   0

In [79]:
df1=df.reindex([0,'a'], fill_value=0) # 기존에 있던것은 가져오고, 없는 것은 추가
df1.shape

(2, 5)

In [80]:
df1

   이름  수학  영어  음악  체육
0  서준  90  98  93  30
a   0   0   0   0   0

# 인덱스 & 컬럼 일부분 변경 --------------------------------

- 기존 인덱스/컬럼에서 일부분 변경하는 메서드

- DF객체변수명.rename(index={기존:새},columns={기존:새}, inplace=False)
    - 인덱스 변경: DF객체변수명.rename(index={기존:새,기존:새,...},inplace=False)
    - 컬럼 변경 : DF객체변수명.rename(columns={기존:새,기존:새,...},inplace=False)

In [85]:
df2=df.rename(columns={"수학":"MATH","음악": "MUSIC"})
df2

   이름  MATH  영어  MUSIC  체육
0  서준    90  98     93  30
1  우현    80  20     30  50
2  인아    70  72     20  60
3  우현    60  50     40  50